Hayden-Schmidt/OpenApex/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_FREERTOS_HZ=1000
CONFIG_LVGL_ENABLE=y
# Fonts the 240px screens actually use: 18 for the odometer-page unit, 20 for the idle odometer
# bubble / odometer-page tenths,
# 28 for the heading readout and clock, 38 for the odometer digits, 44 for the idle clock
# (design reference/2. Idle Screen, 4. Odometer page). Each built-in face costs flash, so enable a
# size only when a page needs it. Sizes must be mirrored in firmware/sim_lvgl/include/lv_conf.h or
# the simulator silently renders a page at a different size than the device does.
# The 466px RICH tier wants larger still — that needs an lv_font_conv-generated face, not another
# built-in, since LVGL's bundled Montserrat stops at 48.
# Audio, microphone, and codec features are intentionally absent from Phase 1.

# BLE: NimBLE host, peripheral role (terminal advertises and hosts the nav GATT service; the
# Android relay connects as central and writes packets in). Central/observer roles are unused for
# now — see docs/OpenApex_SPEC.md §16.5 for why the terminal is the peripheral, not the phone.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
# Bond storage must survive reboot: the "bike on -> device boots -> phone reconnects" flow relies
# on the terminal and phone staying bonded across power cycles, not re-pairing every boot.
CONFIG_BT_NIMBLE_NVS_PERSIST=y

# Text fonts: only MONTSERRAT_14 stays built-in (it draws the phone-supplied street name and
# ETA, and is LV_FONT_DEFAULT). 18/20/28/38/44 are now subsetted faces generated by
# tools/build_font_subset.py -- see design/fonts/fonts_manifest.json. The built-ins cost 231 KB
# of the 1.5 MB app partition for glyphs the GUI never draws.
CONFIG_LV_FONT_MONTSERRAT_14=y
